**** DONE Exercise 1.3
   :PROPERTIES:
   :NOTER_PAGE: (29 . 0.8133333333333334)
   :END:
   Define a procedure that takes three numbers as arguments and returns the sum of the squares of the two larger numbers.
   #+BEGIN_SRC scheme
  (define (max_iter list max)
    (cond ((null? list) max)
	  ((> max (car list)) (max_iter (cdr list) max))
	  (else (max_iter (cdr list) (car list)))))
  (define (max list) (max_iter list (car list)))
  (define (remove_from_list_iter element inputList outputList removed)
  (cond ((null? inputList) outputList)
        ((or removed (not (equal? element (car inputList)))) (remove_from_list_iter element (cdr inputList) (cons (car inputList) outputList) removed))
	(else (remove_from_list_iter element (cdr inputList) outputList #t)))
  )
  (define (remove_from_list element list) (remove_from_list_iter element list '() #f))
  (define (square a) (* a a))
  (define (sum_of_square_of_two_largest a b c) (+ (square (max (list a b c))) (square (max (remove_from_list (max (list a b c)) (list a b c))))))
  (sum_of_square_of_two_largest 1 2 3)
   #+END_SRC

   #+RESULTS:
   : 13

**** DONE Exercise 1.7
   :PROPERTIES:
   :NOTER_PAGE: (33 . 0.2)
   :END:
   The good-enough? test used in computing square roots will not be very effective
   for finding the square roots of very small numbers. Also, in real computers, arithmetic
   operations are almost always performed with limited precision. This makes our test inadequate
   for very large numbers. Explain these statements, with examples showing how the test fails for
   small and large numbers. An alternative strategy for implementing good-enough? is to watch
   how guess changes from one iteration to the next and to stop when the change is a very small
   fraction of the guess. Design a square-root procedure that uses this kind of end test. Does this
   work better for small and large numbers?

   For very large numbers the tolerance being so small will keep the program in an infinite loop because due to limited precission the difference between the square of the guess and the input number will never be smaller than the tolerance.
   For very small number you'll fulfill the tolerance condition way before finding a reasonable approximation for the sqrt value.

   Improved srt:
   The idea is to check whether the guess is good enough by checking how much it is changing between iterations not how close it is to the expected value
   #+BEGIN_SRC scheme
      (define (average x y) 
      (/ (+ x y) 2)) 

      (define (square x) (* x x))
   
      (define (improve guess x) 
      (average guess (/ x guess))) 

      (define (abs x) (if (< x 0) (- x) x))

      (define (good-enough? guess x) 
      (> 0.00001 (abs (- (improve guess x) guess))))
   
      (define (sqrt-iter guess x) 
      (if (good-enough? guess x) 
      guess 
      (sqrt-iter (improve guess x) 
      x)))
   
      (define (sqrt x) 
      (sqrt-iter 1 x)) 
      
      (sqrt 0.000001)
   #+END_SRC

   #+RESULTS:
   : 0.0010005538710539446

**** DONE Exercise 1.8
   :PROPERTIES:
   :NOTER_PAGE: (33 . 0.37333333333333335)
   :END:
   Newton's method for cube roots is based on the fact that if y is an approximation
   to the cube root of x, then a better approximation is given by the value: (see image in pdf)
   Use this formula to implement a cube-root procedure analogous to the square-root procedure.
   
   #+BEGIN_SRC scheme
     (define (average x y) 
     (/ (+ x y) 2)) 

     (define (square x) (* x x))

     (define (improve guess x)
       (/
	 (+ (* 2 guess)
	    (/ x (square guess)))
	 3)) 

     (define (abs x) (if (< x 0) (- x) x))

     (define (good-enough? guess x) 
     (> 0.00001 (abs (- (improve guess x) guess))))

     (define (cbrt-iter guess x) 
     (if (good-enough? guess x) 
     guess 
     (cbrt-iter (improve guess x) 
     x)))

     (define (cbrt x) 
     (cbrt-iter 1 x)) 

     (cbrt 27.0)   
   #+END_SRC

   #+RESULTS:
   : 3.0000005410641766

**** DONE Exercise 1.12
     :PROPERTIES:
     :NOTER_PAGE: (47 . 0.5475255302435192)
     :END:

     The following pattern of numbers is called Pascal's triangle.
     The numbers at the edge of the triangle are all 1, and each number inside the triangle is the sum
     of the two numbers above it. 35 Write a procedure that computes elements of Pascal's triangle by
     means of a recursive process.

           0
         0 1 0
        0 1 1 0
       0 1 2 1 0
      0 1 3 3 1 0
     0 1 4 6 4 1 0

     (pascal row column) ===> number

     #+BEGIN_SRC scheme
       ;            0
       ;         0  1  0
       ;        |0  |1|  1|  0
       ;   0  |1  2|  1  0
       ;  0  1  |3|  3  1  0
       ; 0  1  4  6  4  1  0


       ;(pascal 3 1) => (pascal 2 0) + (pascal 2 1)
       ;(pascal 2 0) => (pascal 1 -1) + (pascal 1 0)
       ;(pascal 2 1) => (pascal 1 0) + (pascal 1 1)

       (define (pascal row column)
	 (cond  ((< row 0) 0)
		((< column 0) 0)
		((> column row ) 0)
		((and (= row 0) (= column 0)) 1)
		(else (+ (pascal (- row 1) column)
			  (pascal (- row 1) (- column 1))))))

       (pascal 4 2)
     #+END_SRC

     #+RESULTS:
     : 6

**** DONE Exercise 1.17
     :PROPERTIES:
     :NOTER_PAGE: (51 . 0.03333333333333333)
     :END:
     This algorithm takes a number of steps that is linear in b . Now suppose we include, together
     with addition, operations double, which doubles an integer, and halve, which divides an (even)
     integer by 2. Using these, design a multiplication procedure analogous to fast-expt that uses
     a logarithmic number of steps.
     
     #+BEGIN_SRC scheme
       (define (even? n) (= (remainder n 2) 0))
       (define (double n) (* n 2))
       (define (halve n) (/ n 2))
       (define (multiply a b)
	 (cond ((or (= a 0) (= b 0)) 0)
	       ((= b 1) (+ a))
	       ((even? b) (double (multiply a (/ b 2))))
	       (else (+ a (multiply a (- b 1))))))

       (multiply 2 3)
     #+END_SRC

     #+RESULTS:
     : 6

**** DONE Exercise 1.25
     :PROPERTIES:
     :NOTER_PAGE: (56 . 0.6)
     :END:

     #+BEGIN_SRC scheme :results output
       (define (square x)
	 (display "square:")
	 (display x)
	 (newline)
	 (* x x)
	 )
       (define (even? x) (if (= 0 (remainder x 2)) #t #f))
       (define (fast-expt b n)
	 (cond ((= n 0) 1)
	       ((even? n) (square (fast-expt b (/ n 2))))
	       (else (* b (fast-expt b (- n 1))))))


       (define (expmod base exp m)
	 (display "base:")
	 (display base)
	 (display " ")
	 (display "exp:")
	 (display exp)
	 (display " ")
	 (display "m:")
	 (display m)
	 (newline)
	 (cond ((= exp 0) 1)
	       ((even? exp)
		(remainder (square (expmod base (/ exp 2) m))
			   m))
	       (else
		(remainder (* base (expmod base (- exp 1) m))
			   m))))

       (define (expmod2 base exp m)
	 (display "base:")
	 (display base)
	 (display " ")
	 (display "exp:")
	 (display exp)
	 (display " ")
	 (display "m:")
	 (display m)
	 (newline)
	 (remainder (fast-expt base exp) m))


       (expmod 5 101 101)
       (display "---------")
       (newline)
       (expmod2 5 101 101)
     #+END_SRC

     #+RESULTS:
     #+begin_example
     base:5 exp:101 m:101
     base:5 exp:100 m:101
     base:5 exp:50 m:101
     base:5 exp:25 m:101
     base:5 exp:24 m:101
     base:5 exp:12 m:101
     base:5 exp:6 m:101
     base:5 exp:3 m:101
     base:5 exp:2 m:101
     base:5 exp:1 m:101
     base:5 exp:0 m:101
     square:5
     square:24
     square:71
     square:92
     square:1
     square:1
     ---------
     base:5 exp:101 m:101
     square:5
     square:125
     square:15625
     square:244140625
     square:298023223876953125
     square:88817841970012523233890533447265625
     #+end_example

     As we can see by the printed output the original expmod function contains a modulo(remainder) operation within
     it that makes sure that the numbers being squared do not become higher than the number m being tested. On the
     other hand the second expmod implementation squares numbers that can be very long due to it only applying the
     modulo(remainder) operation once at the end and arithmetic with arbitrarily long numbers is expensive.

**** DONE Exercise 1.26
     :PROPERTIES:
     :NOTER_PAGE: (56 . 0.7666666666666667)
     :END:

     Original
     #+BEGIN_SRC scheme :results output
       (define (square x)
	 (display "square:")
	 (display x)
	 (newline)
	 (* x x)
	 )
       (define (even? x) (if (= 0 (remainder x 2)) #t #f))

       (define (expmod base exp m)
	 (display "base:")
	 (display base)
	 (display " ")
	 (display "exp:")
	 (display exp)
	 (display " ")
	 (display "m:")
	 (display m)
	 (newline)
	 (display "-----")
	 (newline)
	 (cond ((= exp 0) 1)
	       ((even? exp)
		(remainder (square (expmod base (/ exp 2) m))
			   m))
	       (else
		(remainder (* base (expmod base (- exp 1) m))
			   m))))

       (expmod 2 4 3)
     #+END_SRC

     #+RESULTS:
     #+begin_example
     base:2 exp:4 m:3
     -----
     base:2 exp:2 m:3
     -----
     base:2 exp:1 m:3
     -----
     base:2 exp:0 m:3
     -----
     square:2
     square:1
     #+end_example

     Modified
     #+BEGIN_SRC scheme :results output
       (define (square x)
	 (display "square:")
	 (display x)
	 (newline)
	 (* x x)
	 )
       (define (even? x) (if (= 0 (remainder x 2)) #t #f))

       (define (expmod base exp m)
	 (display "base:")
	 (display base)
	 (display " ")
	 (display "exp:")
	 (display exp)
	 (display " ")
	 (display "m:")
	 (display m)
	 (newline)
	 (display "-----")
	 (newline)
	 (cond ((= exp 0) 1)
	       ((even? exp)
		(remainder (* (expmod base (/ exp 2) m)
			      (expmod base (/ exp 2) m))
			   m))
	       (else
		(remainder (* base (expmod base (- exp 1) m))
			   m))))

       (expmod 2 4 3)
     #+END_SRC

     #+RESULTS:
     #+begin_example
     base:2 exp:4 m:3
     -----
     base:2 exp:2 m:3
     -----
     base:2 exp:1 m:3
     -----
     base:2 exp:0 m:3
     -----
     base:2 exp:1 m:3
     -----
     base:2 exp:0 m:3
     -----
     base:2 exp:2 m:3
     -----
     base:2 exp:1 m:3
     -----
     base:2 exp:0 m:3
     -----
     base:2 exp:1 m:3
     -----
     base:2 exp:0 m:3
     -----
     #+end_example

     As you can see by running both and looking at the printed output, the procedure that uses the product directly
     creates a recursive tree process that results in a lot of redundant computations.

**** DONE Exercise 1.32
     :PROPERTIES:
     :NOTER_PAGE: (64 . 0.016666666666666666)
     :END:

     #+BEGIN_SRC scheme :results output
					       ; Identity
       (define (identity x) x)

					       ; Increment
       (define (inc x) (+ x 1))
					       ; Recursive Solution
       (define (acc_r a b base combiner term next)
	 (if (> a b) base
	     (combiner (term a) (acc_r (next a) b base combiner term next))))
					       ; Iterative Solution
       (define (acc a b base combiner term next)
	 (define (iter a result)
	   (if (> a b)
	       result
	       (iter (next a) (combiner (term a) result))))
	 (iter a base))

       (define (sum a b term next)  (acc a b 0 + term next))
       (define (sum_r a b term next)  (acc_r a b 0 + term next))
       (define (product a b term next)  (acc a b 1 * term next))
       (define (product_r a b term next)  (acc_r a b 1 * term next))

       (display "sum1_10i: ")(display (sum 1 10 identity inc))(newline)
       (display "sum1_10r: ")(display (sum_r 1 10 identity inc))(newline)
       (display "product1_5i: ")(display (product 1 5 identity inc))(newline)
       (display "product1_5r: ")(display (product_r 1 5 identity inc))(newline)
     #+END_SRC

     #+RESULTS:
     : sum1_10i: 55
     : sum1_10r: 55
     : product1_5i: 120
     : product1_5r: 120

**** DONE Exercise 2.5
     :PROPERTIES:
     :NOTER_PAGE: (89 . 0.7333333333333333)
     :END:

     #+BEGIN_SRC scheme :results output
       (define (exp base n)
	 (define (exp_iter base n acc)
	   (if (= n 0) acc (exp_iter base (- n 1) (* acc base))))
	 (exp_iter base n 1))

       (define (count-powers num base)
	 (define (count-powers-iter num base count)
	   (define temp (/ num base))
	   (if (= (floor temp) temp)
	       (count-powers-iter temp base (+ count 1))
	       count))
	 (count-powers-iter num base 0))

       (define (cons a b)
	 (* (exp 2 a) (exp 3 b)))

       (define (car p)
	 (count-powers p 2))

       (define (cdr p)
	 (count-powers p 3))

       (display "pair = (5 3)")
       (newline)
       (define pair (cons 5 3))
       (display "pair(x) = ") (display (car pair))
       (newline)
       (display "pair(y) = ") (display (cdr pair))

     #+END_SRC

     #+RESULTS:
     : pair = (5 3)
     : pair(x) = 5
     : pair(y) = 3

**** DONE Exercise 2.9
     :PROPERTIES:
     :NOTER_PAGE: (91 . 0.6)
     :END:

     #+BEGIN_SRC scheme :results output
					       ; Interval Arithmetic Operations
       (define (add-interval x y)
	 (make-interval (+ (lower-bound x) (lower-bound y))
			(+ (upper-bound x) (upper-bound y))))

       (define (mul-interval x y)
	 (let ((p1 (* (lower-bound x) (lower-bound y)))
	       (p2 (* (lower-bound x) (upper-bound y)))
	       (p3 (* (upper-bound x) (lower-bound y)))
	       (p4 (* (upper-bound x) (upper-bound y))))
	   (make-interval (min p1 p2 p3 p4)
			  (max p1 p2 p3 p4))))

       (define (div-interval x y)
	 (mul-interval x
		       (make-interval (/ 1.0 (upper-bound y))
				      (/ 1.0 (lower-bound y)))))
					       ; Constructor
       (define (make-interval a b) (cons a b))

					       ; Selectors
       (define (upper-bound interval) (max (car interval) (cdr interval)))
       (define (lower-bound interval) (min (car interval) (cdr interval)))

					       ; Substraction
       (define (sub-interval i1 i2)
	 (add-interval i1
		       (make-interval (- (upper-bound i2))
				      (- (lower-bound i2)))))
					       ; Display
       (define (display_width interval)
	 (display (/ (- (upper-bound interval)
			(lower-bound interval)) 2)))
       (define (display_interval interval)
	 (display "[")
	 (display (lower-bound interval))
	 (display ", ")
	 (display (upper-bound interval))(display "]"))

					       ; Show differnce of sum or difference is a function only of the width of the intervals
					       ; Show that is not the case for multiplication and division

       (define i_v1 (make-interval 1 5))
       (define i_v2 (make-interval 5 1))
       (define i_v3 (make-interval 4 8))
       (define i_v4 (make-interval -6 -2))
       (define sum_interval_1 (add-interval i_v1 i_v2))
       (define diff_interval_1 (sub-interval i_v1 i_v2))
       (define mul_interval_1 (mul-interval i_v1 i_v2))
       (define div_interval_1 (div-interval i_v1 i_v2))
       (define sum_interval_2 (add-interval i_v3 i_v4))
       (define diff_interval_2 (sub-interval i_v3 i_v4))
       (define mul_interval_2 (mul-interval i_v3 i_v4))
       (define div_interval_2 (div-interval i_v3 i_v4))

       (display "sum1_width = ")(display_width sum_interval_1)(newline)
       (display "sum2_width = ")(display_width sum_interval_2)(newline)

       (display "diff1_width = ")(display_width diff_interval_1)(newline)
       (display "diff2_width = ")(display_width diff_interval_2)(newline)

       (display "mul1_width = ")(display_width mul_interval_1)(newline)
       (display "mul2_width = ")(display_width mul_interval_2)(newline)

       (display "div1_width = ")(display_width div_interval_1)(newline)
       (display "div2_width = ")(display_width div_interval_2)(newline)
     #+END_SRC

     #+RESULTS:
     : sum1_width = 4
     : sum2_width = 4
     : diff1_width = 4
     : diff2_width = 4
     : mul1_width = 12
     : mul2_width = 20
     : div1_width = 2.4
     : div2_width = 1.6666666666666667

     We used two pairs of intervals with equal widths to test the claim and as we can see
     the resulting values for the sum and difference for these intervals is the same
     while the result for the multiplation and divition is not.

**** DONE Exercise 2.10
     :PROPERTIES:
     :NOTER_PAGE: (91 . 0.75)
     :END:

     #+BEGIN_SRC scheme :results output
					       ; Interval Arithmetic Operations
       (define (add-interval x y)
	 (make-interval (+ (lower-bound x) (lower-bound y))
			(+ (upper-bound x) (upper-bound y))))

       (define (mul-interval x y)
	 (let ((p1 (* (lower-bound x) (lower-bound y)))
	       (p2 (* (lower-bound x) (upper-bound y)))
	       (p3 (* (upper-bound x) (lower-bound y)))
	       (p4 (* (upper-bound x) (upper-bound y))))
	   (make-interval (min p1 p2 p3 p4)
			  (max p1 p2 p3 p4))))

       (define (div-interval x y)
	 (mul-interval x
		       (make-interval (/ 1.0 (upper-bound y))
				      (/ 1.0 (lower-bound y)))))
					       ; Constructor
       (define (make-interval a b) (cons a b))

					       ; Selectors
       (define (upper-bound interval) (max (car interval) (cdr interval)))
       (define (lower-bound interval) (min (car interval) (cdr interval)))

					       ; Substraction
       (define (sub-interval i1 i2)
	 (add-interval i1
		       (make-interval (- (upper-bound i2))
				      (- (lower-bound i2)))))
					       ; Width
       (define (width-interval interval)
	 (/ (- (upper-bound interval)
	       (lower-bound interval)) 2))


       (define (div-interval-safe x y)
	 (if (>= 0 (* (upper-bound y) (lower-bound y)))
	     (error "Division by an interval that spans zero is meaningless.")
	     (div-interval x y)))

       (define i_v1 (make-interval 1 5))	
       (define i_v2 (make-interval -2 1))

       (display (div-interval-safe i_v1 i_v1))(newline)
       (display (div-interval-safe i_v1 i_v2))(newline)
     #+END_SRC

     #+RESULTS:
     : (0.2 . 5.0)
     : Division by an interval that spans zero is meaningless.
     : 

**** DONE Exercise 2.21
     :PROPERTIES:
     :NOTER_PAGE: (100 . 0.7333333333333333)
     :END:

     #+BEGIN_SRC scheme :results output
       (define (map proc items)
	 (if (null? items)
	     nul
	     (cons (proc (car items))
		   (map proc (cdr items)))))

       (define (square-list items)
	 (if (null? items)
	     null
	     (cons (* (car items) (car items)) (square-list (cdr items)))))

       (define (square-list2 items)
	 (map (lambda (x) (* x x)) items))

       (display "(1 4 9 16) = ")(display (square-list (list 1 2 3 4)))(newline)
       (display "(1 4 9 16) = ")(display (square-list2 (list 1 2 3 4)))(newline)
     #+END_SRC

     #+RESULTS:
     : (1 4 9 16) = (1 4 9 16)
     : (1 4 9 16) = (1 4 9 16)

